Repository: klilmhdi/shopbase
Catalog: lib/l10n/intl_*.arb
Languages: ar

# arab
source: Arabic
ar: العربية

# eng
source: English
ar: الإنجليزية

# change_lang_title
source: Change Language
ar: تغيير اللغة

# on_boarding_title_1
source: SELECT ITEMS
ar: حدد المنتجات اللي انت عايزها

# on_boarding_title_2
source: PURCHASE
ar: حاسب على مشترياتك

# on_boarding_title_3
source: DELIVERY
ar: التوصيل لحد باب بيتك

# on_boarding_subtitle_1
source: this is subtitle 1, Lorem Ipsum is simply dummy text of the printing and typesetting industry.
ar: الديسكريبشن رقم 1, ابجد هوز كلمن صعفت قرشت ابجد هوز كلمن صعفت قرشت ابجد هوز كلمن صعفت قرشت

# on_boarding_subtitle_2
source: this is subtitle 2, Lorem Ipsum is simply dummy text of the printing and typesetting industry.
ar: الديسكريبشن رقم 2, ابجد هوز كلمن صعفت قرشت ابجد هوز كلمن صعفت قرشت ابجد هوز كلمن صعفت قرشت

# on_boarding_subtitle_3
source: this is subtitle 3, Lorem Ipsum is simply dummy text of the printing and typesetting industry.
ar: الديسكريبشن رقم 3, ابجد هوز كلمن صعفت قرشت ابجد هوز كلمن صعفت قرشت ابجد هوز كلمن صعفت قرشت

source: Get Started
ar: إبدأ الآن

# welcome_title
source: Welcome to ShopBase
ar: مرحباً بك في ShopBase

# welcome_subtitle
source: Interest with awesome suits, cloathes, and accessories for men 🤗
ar: اهتم بالبدلات والهدوم والإكسسوارات الرائعة والمميزة للرجال 🤗

source: Login
ar: تسجيل الدخول

source: Register
ar: إنشاء حساب

source: Name
ar: الإسم كاملاً

source: Email
ar: البريد الالكتروني

# phone
source: Phone Number
ar: رقم الهاتف

source: Password
ar: كلمة السر

source: Forget your password?
ar: هل نسيت كلمة المرور؟

# name_validation
source: Please! fill the full name field empty!
ar: برجاء ملء حقل الإسم بالكامل

# email_validation
source: Please! fill the email field empty!
ar: برجاء ملء حقل البريد الإلكتروني

# phone_validation
source: Please! fill the phone number field empty!
ar: برجاء ملء حقل رقم الهاتف

# password_validation
source: Please! fill the password field empty!
ar: برجاء ملء حقل الباسوورد

# error_login_snackbar
source: Please! Check your input again!
ar: الرجاء التحقق من صحة البيانات المدخلة

source: Sign in using Google
ar: إنشاء حساب بإستخدام قوقل

# verify
source: Data verifying
ar: التحقق من البيانات

# verify_title
source: We sent code verification to:
ar: لقد أرسلنا كود تحقق الى الرقم:

# verify_button
source: Check
ar: تحقق

# new_title
source: New
ar: الجديد

# new_subtitle
source: You've never seen it before!
ar: حاجات طرش الطرش مشفتش زيها قبل كدة

# sale_title
source: Sale
ar: التخفيضات

# sale_subtitle
source: Special sales for this season
ar: عروضنا جامدة يباشا السيزون دا

source: Show All
ar: عرض الكل

source: Home
ar: الرئيسية

# home_title_1
source: Street Clothes
ar: الملابس العصرية

# home_title_2
source: Fashion Sale
ar: عروض وخصومات

# bag
source: Bags
ar: سلة التسوق

# bag_title
source: My bags
ar: شنطتي

source: Shop
ar: تسوق

# fav
source: Favourite
ar: المفضلة

# fav_title
source: My favourites
ar: المفضلات

source: Profile
ar: الحساب

source: My orders
ar: عروضي

# payment_method
source: Payment methods
ar: طرق الدفع

# shipping_address
source: Shipping addresses
ar: العنوانين

source: Promocodes
ar: الكوبونات

# settings
source: Settings page
ar: الإعدادات

source: Edit your profile
ar: تعديل بيانات الحساب

source: Theme
ar: ثيم التطبيق

# lang
source: Language
ar: اللغة

# notif
source: Notification
ar: الإشعارات

# priv_policy
source: Privacy policy
ar: سياسة الخصوصية

source: Rate us
ar: قيمنا

source: Logout
ar: تسجيل خروج

# logout_title
source: Are you sure to logout?
ar: هل أنت متأكد من انك تريد تسجيل الخروج؟

# confirm
source: Sure
ar: بالتأكيد

source: Cancel
ar: إلغاء

# error_title
source: We work to solve this problem.
ar: نعمل على تطوير هذه الميزة

source: Brand
ar: البراند

# code
source: Product Code
ar: كود المنتج

source: Leather
ar: نسبة الليكرا

# about_product_title
source: About
ar: عن المنتج

source: Add to card
ar: أضف للسلة

source: Size
ar: المقاس

source: Quantity
ar: الكمية

source: Price
ar: السعر

source: Color
ar: اللون

source: Checkout
ar: اطلب الآن

source: Product total price
ar: السعر الاجمالي لطلباتك

source: Delivery price
ar: مصاريف الشحن

source: Total amount
ar: الحساب الإجمالي

# success_add_to_favourite
source: Success added to favourite!!
ar: تم الاضافة لقائمة المفضلة بنجاح!!

# no_news_products
source: There isn't' news products, yet!!
ar: لا توجد منتجات مضافة حديثاً

# no_bags_data
source: There isn't products in bags, yet!!
ar: مفيش حاجة اتضافت للسلة لحتى الان!!

# add_payment_credit
source: Add new payment credit
ar: إضافة بطاقة دفع جديدة

source: Card number
ar: رقم البطاقة

# full_name
source: Full name (as a credit)
ar: الإسم بالكامل (على حسب البطاقة)

source: Add card
ar: حفظ البطاقة

# add_credit_success_title
source: Created successfully!!
ar: تمت الاضافة بنجاح!!

# add_credit_success_subtitle
source: Your complete create card payment successfully, Congratulation!
ar: لقد اكملت اجراءات اضافة بطاقة دفع بنجاح, تهانينا!!

# login_user_didnt_found
source: This user didn't found.
ar: اليوزر دا مش موجود فالسيستم.

# login_invalid_password
source: Email or password didn't correct.
ar: الايميل أوالباسوورد فيهم مشكلة.

# login_invalid_email
source: The email address is not valid.
ar: الايميل فيه مشكلة.

# login_user_disabled
source: This user account has been disabled.
ar: اليوزر دا اتشال من السيرفر.

# login_operation_not_allowed
source: Operation not allowed. Contact support.
ar: حالياً في مشكلة في عملية تسجيل الدخول , اتصل بالدعم الفني.

# login_too_many_requests
source: Too many requests. Try again later.
ar: حاول مرة ثانية , في مشكلة فالسيرفر.

# login_error
source: Error in Login:
ar: مشكلة في تسجيل الدخول:
